Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N13A.tmx
Source language: en_us
Languages: zh_cn

source: In Country
zh_cn: 搬进贫民窟

source: 'That it then?'
zh_cn: “就这些了？”

source: I nodded, and Derek the removal man turned back to the van, gave a wave to his driver and went to the back to lift the ramp, close the hatched and seal up the contents of my previous life.
zh_cn: 我点点头，搬运工德里克转向货车，对司机摆摆手，然后走到后面抬起活动斜梯，关上车厢门，封存了我之前生活的所有东西。

source: You don't really want removal men to be efficient and clean; you want them to be burly, and surly, beer-bellied, with pie-breath and greasy flat-cap. You want them to pause, rub their aching back and take a sharp intake of breath; 'dunno about that guvna. Isn't on the manifest.
zh_cn: 你真的不希望搬运工高效、干净；你希望他们强壮、粗暴、腆着啤酒肚、口气中有馅饼味儿，还有油渍斑斑的平顶帽。你希望他们暂停片刻，揉揉他们酸痛的背，然后猛地吸一口气；不知道那个芭乐，不在载货单上。

source: You want chipped cups, splintered furniture, mashed boxes, lost boxes.
zh_cn: 你希望有缺口的杯子、破碎的家具、压烂的箱子、丢失的箱子。

source: Delays. Traffic jams. Running over time. Running out of time.
zh_cn: 延迟，交通堵塞，超过时间了，时间剩下不多了。

source: You want stuff stored in the wrong rooms, too-heavy-to-move tea-chests dumped in the passage, stuff left behind to be collected, or not, three shame-faced weeks later, after seven increasingly irate phone calls from the new homeowner.
zh_cn: 你希望三个丢脸的星期后，在新房主七通日益愤怒的电话之后，东西贮存在错的房间里，重得搬不动的茶叶箱堆在过道上，留下还要收走的或不要的东西。

source: You want inefficiency, damage and loss.
zh_cn: 你希望低效、损坏和遗失。

source: In fact, if you were in my position, you would want the removal men to simply forget to arrive; you'd want the estate agent to lose the contracts shortly before the exchange takes place; you'd want the utility companies to forget to switch.
zh_cn: 事实上，如果你处在我的处境，你会希望搬运工完全忘记来了；你会希望房产经纪人在交易发生前不久丢了合同；你会希望公用事业公司忘了变更户主。

source: And you'd want your wife not to have left you.
zh_cn: 而且你还希望你妻子没有离开你。

source: Derek snapped shut the padlock on the back of the van, nodded in my direction and walked round to climb into the passenger seat.
zh_cn: 德里克吧嗒一声锁上货车后面的挂锁，向我的方向点点头，然后绕过去爬进乘客位。

source: With a cough of blue smoke the diesel engine fired up and the driver wasted no time in crunching it into gear and thrusting it out amongst the blaring horns of midday London traffic.
zh_cn: 随着噗噗地冒出一股蓝烟，柴油引擎发动起来，司机一刻也没耽误，嘎吱嘎吱地开起车，冲进了正午的伦敦交通那刺耳的喇叭鸣叫之中。

source: Some of what was in the back of the van was coming with us to our new home, but a lot more was to be dropped off at the auction house later.
zh_cn: 装在货车后面的东西中有一些要和我们一起去我们的新家，但是更多的是要稍后送到拍卖行去。

source: The way I felt at that moment, it could have all been taken direct to a landfill.
zh_cn: 在那一刻我觉得，所有这些东西本来可以直接送到垃圾填埋场去。

source: This is not what I asked for, I told myself, as I slipped the door keys into an envelope, sealed it and pinned the envelope to the wall just inside the front door.
zh_cn: 在我把门钥匙塞进一个信封、封住口并把信封钉在前门里面的墙上时，我告诉自己说，这不是我所寻求的。

source: Then, after folding my copy of Derek the removal man's manifest and slipping it into my pocket, I took one last look along the hall, past the front room door, past the dining room door, to the kitchen, where we'd breakfasted every morning for years, first as man and wife, and then man and wife and child, and lately, as father and son.
zh_cn: 然后，叠起搬运工德里克给我的那一联载货单并塞进我的口袋后，我最后一次顺着过道看过去，经过客厅门、经过餐厅门，直到厨房，我们多年来每天早上在那儿吃早饭，先是丈夫和妻子，然后是丈夫和妻子和孩子，不久前，是父亲和儿子。

source: On impulse I stepped back inside, walked along the hall to the kitchen door and took one last look inside, imagining us some seven years ago, seeing again the chaos of a young, happily married couple and their baby boy, eating breakfast, getting ready for work, talking, being a family.
zh_cn: 我一时冲动，走了回去，沿着过道走到厨房门口，向里看了最后一眼，想象着大约七年前的我们，再次看到一对年轻幸福的已婚夫妇和他们的小男婴，吃早饭、准备去工作、谈话、一家人在一起。

source: I saw this picture in my head, felt the anguish of what I'd never have again, and then, having faced my grief, it faded.
zh_cn: 我在头脑中看到这幅图画，感觉到对我绝不会再拥有的东西的那种痛苦，然后，已然面对过我的悲伤，它渐渐退去。

source: Quietly, almost reverentially, I closed the door and, taking a purposeful deep breath, I walked back along and out through the front door, turned and slammed it shut on my old life.
zh_cn: 我平静地、几乎是谨慎地关上门，然后坚定地深吸口气，向回走去，走出前门，转身，砰地一声关闭了我的旧日生活。

source: Feeling somehow lighter, I walked down the steps from what had been my front door and across the road to the car, to where Danny was sitting absorbed in his book.
zh_cn: 不知怎么地感觉轻松了些，我从曾经是我的前门走下台阶，穿过马路走向我的车，到丹尼坐着全神贯注读书的地方。

source: I opened the driver's door and got in; 'Ready for an adventure?'
zh_cn: 我打开驾驶员门，上车；“准备好去探险了吗？”

source: I asked him, fastening my seat belt, adjusting the wonky rear-view mirror until it seemed prepared to stay in one position long enough for me to be able to ascertain that we weren't going to be crushed by a speeding juggernaut or a fire-engine while driving along the Queen's Highway, and turned the ignition key.
zh_cn: 我问他，系紧我的安全带，调整那个摇摇晃晃的后视镜直到它好像准备好待在一个地方足够长的时间，让我能够确定在沿着皇家公路行驶时我们不会被一辆超速行驶的重型卡车或一辆消防车压碎，然后转动点火开关。

source: He nodded, still looking at his book, 'Sure,' and reached over and patted my hand.
zh_cn: 他点点头，依然看着他的书，“当然，”然后伸过手来拍拍我的手。

source: 'What's that for?' I asked.
zh_cn: “这是做什么？”我问。

source: He looked up at me, 'I'm on your side, dad.
zh_cn: 他抬头看看我，“我支持你，老爸。

source: That's all.'
zh_cn: 就这。”

source: 'You're eight.
zh_cn: “你才八岁。

source: You don't get to be on someone's side at eight.'
zh_cn: 在八岁你还支持不了别人。”

source: He smiled knowingly, and went back to his book.
zh_cn: 他心照不宣地笑笑，然后又返回到他的书上。

source: On the third attempt, the engine of our brand-new, seven-year-old Fiat managed to fire up; I adjusted the mirror again, signaled and pushed out into the traffic.
zh_cn: 在第三次尝试时，我们那全新的、七岁的菲亚特的引擎终于发动起来了；我又一次调整后视镜，打信号并挤进车流中去。

source: We drove out of the street where we'd lived for nine years without looking back.
zh_cn: 我们驶出了居住了九年的街道，没有向回看。

source: Though that could have been because the rear-view mirror had slipped down and sideways once more, giving me a clear view of the passenger side dashboard air-vent.
zh_cn: 尽管那可能是因为后视镜再一次滑下来歪到一边，给我呈现了一幅乘客位仪表盘通风口的清晰景象。

source: 'I like adventures,' Danny said, after about ten minutes.
zh_cn: “我喜欢探险，”大约十分钟后丹尼说道。

source: I rubbed his hair, 'So do we all.'
zh_cn: 我揉揉他的头发，“我们都喜欢。”

source: 'Don't muss up my hair,' he told me. 'It's got gel on.'
zh_cn: “不要弄乱我的头发，”他对我说，“上面涂了发胶。”

source: 'Sorry.'
zh_cn: “对不起。”

source: ''S ok.'
zh_cn: “没关系。”

source: 'When did you start wearing hair gel?'
zh_cn: “你什么时候开始用发胶的？”

source: 'Daaad!'
zh_cn: “老......爸！”

source: We drove south, across the river, and the traffic was lighter than usual, this still being the school holidays.
zh_cn: 我们向南开去，越过泰晤士河，交通量比平常要少，现在还是学校放假期间。

source: Danny looked up and asked, 'Where are we?'
zh_cn: 丹尼抬头看看，问道：“我们在哪儿？”

source: 'Adventure country,' I told him.
zh_cn: “探险之乡，”我告诉他。

source: 'Cool.'
zh_cn: “好极了。”

source: A few minutes later he said, 'The sign says Peckham.'
zh_cn: 几分钟后他说：“标牌上写着佩卡姆。”

source: Fifteen minutes later we turned into a cul-de-sac that contained a row of large but fairly dilapidated Victorian houses surrounded on three sides by large equally dilapidated blocks of 1960's neo-brutalist social housing.
zh_cn: 十五分钟后我们拐进一条死胡同，里面有一排大但相当破旧的维多利亚时代的房子，房子三面环绕着大且同样破旧的1960年代的新野兽派风格的社会福利住房的大楼。

source: Our apartment was in the basement of the house with the removal van parked outside.
zh_cn: 我们的公寓在搬家货车停在其外面的那座房子的地下室。

source: I pulled between the removal van and a skip, jerked on the handbrake, and turned off the engine.
zh_cn: 我在搬家货车和一个工地废料桶之间停下来，猛拉手闸，然后关掉引擎。

source: 'Come on,' I said.
zh_cn: “来吧，”我说。

source: Danny climbed out and went for a look round while I went to unlock the door for Derek and his assistant.
zh_cn: 丹尼爬出来，到四周去看看，与此同时我去给德里克及他的助手开门锁。

source: Then I went and sat on the wall watching Danny running around.
zh_cn: 然后我走开坐在墙上看着丹尼四处跑。

source: From this vantage point, I could look up at the back doors and broken windows of the council flats opposite; I could count the satellite dishes and scan the walkways and stairwells where, no doubt, the feral underclass would prowl of an evening, dealing drugs, stealing phones from pregnant fifteen year-olds, and stabbing each other.
zh_cn: 从这个有利的地点，我能向上看到对面政府公屋的后门和破碎的窗户；我能数圆盘式卫星电视天线并扫视人行道和楼梯井，毫无疑问，在那里野性的底层阶级会在晚上游荡，买卖毒品、从十五岁怀孕少女那里偷手机，并相互刺杀。

source: Danny was running off some energy, exploring nooks and crannies around the cul-de-sac, and I was letting the removal men do their job, and the sun was setting behind a tower block.
zh_cn: 丹尼跑掉了一些精力，正在死胡同里到处探寻隐蔽处和裂缝，我让搬运工干他们的活，太阳正降落在一座塔式大楼后面。

source: 'Don't go too far,' I shouted.
zh_cn: “别跑太远了，”我叫道。

source: He ran over to me, 'What?'
zh_cn: 他向我跑过来，“什么？”

source: 'I said, don't go too far.'
zh_cn: “我说，别跑太远了。”

source: 'Ok.'
zh_cn: “好的。”

source: I went to muss his hair but remembered his warning about the hair gel, so instead asked, 'Well, what you think?'
zh_cn: 我要去弄乱他的头发但想起他关于发胶的警告，所以改为问：“噢，你觉得怎样？”

source: He looked around as the glooming evening spread from shadow to shadow; streetlights were flickering on at random, doorways and corners beginning to look threatening.
zh_cn: 他四面看看，这时阴暗的黄昏从阴影蔓延到阴影；街灯胡乱地忽明忽暗，门口和街角开始看起来危险重重。

source: He looked back at me and whispered, 'Bandit Country,' his eyes glittering, and then he ran off to explore some more.
zh_cn: 他回头看看我，小声说：“强盗之乡，”他的眼睛闪闪发光，然后跑开去探寻更多的未知。
